IDEA StatiCa Open Model
SectionCharacteristics.Sy Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the first moment of area related to the Y axis.
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double Sy { get; set; }
Public Property Sy As Double
	Get
	Set
public:
property double Sy {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
SectionCharacteristics Class
IdeaRS.OpenModel.Geometry2D Namespace